In [1]:
# Plantilla de Pre Procesado

# Cómo importar las librerías
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [21]:
# Importar el data set
dataset = pd.read_csv('Data.csv')
print(dataset.head())
X = dataset.iloc[:, :-1]
y = dataset.iloc[:, 3]

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [3]:
X.head()

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN

In [4]:
y.head()

0     No
1    Yes
2     No
3     No
4    Yes
Name: Purchased, dtype: object

In [5]:
# Escalado de variables
from sklearn.preprocessing import StandardScaler
numericos=X.select_dtypes("number") # separar las columnas numericas
categoricos=X.select_dtypes("object") # seoparar las columnas categoricas
#definir la escala
sc_X = StandardScaler()
#crear nuevo dataframe con los datos numericos escalados
numericos_std =pd.DataFrame(data=sc_X.fit_transform(numericos), columns=numericos.columns.values)
# unir los dataframe de categoricos con el dataframe de los numeicos escalados
X = pd.merge(categoricos,numericos_std, left_index=True, right_index=True)

In [7]:
X.head()

   Country       Age    Salary
0   France  0.719931  0.711013
1    Spain -1.623675 -1.364376
2  Germany -1.210098 -0.845529
3    Spain -0.107224 -0.240207
4  Germany  0.168495       NaN

In [9]:
# Normalizado de variables
from sklearn.preprocessing import MinMaxScaler
numericos=X.select_dtypes("number") # separar las columnas numericas
categoricos=X.select_dtypes("object") # seoparar las columnas categoricas
#definir la escala
sc_X = MinMaxScaler()
#crear nuevo dataframe con los datos numericos escalados
numericos_std =pd.DataFrame(data=sc_X.fit_transform(numericos), columns=numericos.columns.values)
# unir los dataframe de categoricos con el dataframe de los numeicos escalados
X = pd.merge(categoricos,numericos_std, left_index=True, right_index=True)

In [10]:
X.head()

   Country       Age    Salary
0   France  0.739130  0.685714
1    Spain  0.000000  0.000000
2  Germany  0.130435  0.171429
3    Spain  0.478261  0.371429
4  Germany  0.565217       NaN

In [12]:
# Dividir el data set en conjunto de entrenamiento y conjunto de testing
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size = 0.2, random_state = 0)

In [13]:
X_train

   Country       Age    Salary
4  Germany  0.565217       NaN
9   France  0.434783  0.542857
1    Spain  0.000000  0.000000
6    Spain       NaN  0.114286
7   France  0.913043  0.885714
3    Spain  0.478261  0.371429
0   France  0.739130  0.685714
5   France  0.347826  0.285714

In [14]:
X_test

   Country       Age    Salary
2  Germany  0.130435  0.171429
8  Germany  1.000000  1.000000

In [15]:
print(X_test)
print(X_train)
print(y_test)
print(y_train)

   Country       Age    Salary
2  Germany  0.130435  0.171429
8  Germany  1.000000  1.000000
   Country       Age    Salary
4  Germany  0.565217       NaN
9   France  0.434783  0.542857
1    Spain  0.000000  0.000000
6    Spain       NaN  0.114286
7   France  0.913043  0.885714
3    Spain  0.478261  0.371429
0   France  0.739130  0.685714
5   France  0.347826  0.285714
2    No
8    No
Name: Purchased, dtype: object
4    Yes
9    Yes
1    Yes
6     No
7    Yes
3     No
0     No
5    Yes
Name: Purchased, dtype: object

In [22]:
y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Purchased, dtype: object

In [34]:
from sklearn.preprocessing import LabelEncoder
Sc_y = LabelEncoder()
Sc_y.fit(y)
y=Sc_y.transform(y)

In [35]:
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1])